Set up Configuration

In [ ]:
!pip install sqlalchemy==1.3.2

Requirement already satisfied: sqlalchemy==1.3.2 in /usr/local/lib/python3.7/dist-packages (1.3.2)

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
 # ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://jieunshop200:Jieunshop200!1@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev

'Connected: jieunshop200@dev'

이후 아래 SQL에서 "keeyong"는 자신의 스키마로 변경

### 비어 있는 테이블 만들고 레코드 추가하고 COUNT하기

In [ ]:
%%sql

DROP TABLE IF EXISTS jieunshop200.test_table;
CREATE TABLE jieunshop200.test_table (
    value int
);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO jieunshop200.test_table VALUES (NULL), (1), (1), (0), (0), (4), (3);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM jieunshop200.test_table;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None,), (1,), (1,), (0,), (0,), (4,), (3,)]

아래 COUNT 문들의 결과값은 얼마일까?

In [ ]:
%%sql

SELECT COUNT(value) 
FROM jieunshop200.test_table;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(6,)]

In [ ]:
%%sql

SELECT COUNT(DISTINCT value)
FROM jieunshop200.test_table;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(4,)]

### Primary Key 이해해보기와 Data Quality 검사해보기

In [ ]:
%%sql

DROP TABLE IF EXISTS jieunshop200.test_channel;
CREATE TABLE jieunshop200.test_channel (
   channel varchar(32) primary key,
   description varchar(64) default 'test'
);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO jieunshop200.test_channel VALUES ('FACEBOOK', 'test'), ('GOOGLE', 'test');

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM jieunshop200.test_channel;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 'test'), ('GOOGLE', 'test')]

In [ ]:
%%sql

INSERT INTO jieunshop200.test_channel VALUES ('FACEBOOK'), ('GOOGLE');

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

#### FACEBOOK, GOOGLE 중복, Primary Key 적용 안됨

In [ ]:
%%sql

SELECT * FROM jieunshop200.test_channel;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[('FACEBOOK', 'test'),
 ('GOOGLE', 'test'),
 ('FACEBOOK', 'test'),
 ('GOOGLE', 'test')]

#### 중복 데이터 확인 : data quality

In [ ]:
%%sql

SELECT DISTINCT * FROM jieunshop200.test_channel;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 'test'), ('GOOGLE', 'test')]

필드 이름 변경해보기

In [ ]:
%%sql

ALTER TABLE jieunshop200.test_channel RENAME channel to channelname;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.

[]

중복 레코드 확인해보기

In [ ]:
%%sql

SELECT COUNT(1) FROM jieunshop200.test_channel;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(4,)]

In [ ]:
%%sql

SELECT COUNT(1) FROM (
    SELECT DISTINCT * FROM jieunshop200.test_channel
);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2,)]

primary key uniqueness 확인해보기

In [ ]:
%%sql

SELECT channelname, count(1)
FROM jieunshop200.test_channel
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 2), ('GOOGLE', 2)]

타임 스탬프 필드가 있다면 최근에도 업데이트된 레코드가 있는지 꼭 확인. 언제부터 레코드가 생성되었는지도 확인. 월별로 레코드수를 확인해보는 것도 좋은 버릇

In [ ]:
%%sql

SELECT MAX(ts), MIN(ts)
FROM raw_data.session_timestamp;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(datetime.datetime(2019, 11, 30, 23, 58, 23), datetime.datetime(2019, 5, 1, 0, 13, 11, 783000))]

### CASE WHEN을 사용해보기

In [ ]:
%%sql

SELECT LEFT(ts, 7), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-08', 17151),
 ('2019-11', 18059),
 ('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-09', 15790),
 ('2019-10', 18899)]

월별로 10000 혹은 그 이상 세션이면 ">= 10,000" 아니면 "< 10,000" 이렇게 찍어보기

In [ ]:
%%sql

SELECT LEFT(ts, 7), CASE WHEN COUNT(1) >= 10000 THEN '>= 10,000' ELSE '< 10,000' END
FROM raw_data.session_timestamp
GROUP BY 1;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-08', '>= 10,000'),
 ('2019-11', '>= 10,000'),
 ('2019-05', '< 10,000'),
 ('2019-06', '>= 10,000'),
 ('2019-07', '>= 10,000'),
 ('2019-09', '>= 10,000'),
 ('2019-10', '>= 10,000')]

월별로 15000 혹은 그 이상 세션이면 ">= 15,000", 10000보다 작으면 "< 10,000", 그 사이이면 "10000 and 15000" 이렇게 찍어보기

In [ ]:
%%sql

SELECT
    LEFT(ts, 7),
    CASE 
        WHEN COUNT(1) >= 15000 THEN '>= 15,000'
        WHEN COUNT(1) < 10000 THEN '< 10,000'
        ELSE '10000 and 15000'
    END
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', '< 10,000'),
 ('2019-06', '10000 and 15000'),
 ('2019-07', '10000 and 15000'),
 ('2019-08', '>= 15,000'),
 ('2019-09', '>= 15,000'),
 ('2019-10', '>= 15,000'),
 ('2019-11', '>= 15,000')]

### 공백이 들어있는 필드이름 혹은 예약된 키워드를 필드이름으로 사용하려면?

In [ ]:
%%sql

DROP TABLE IF EXISTS jieunshop200.test;
CREATE TABLE jieunshop200.test (
    group int primary key,
    'mailing address' varchar(32)
);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.
(psycopg2.ProgrammingError) syntax error at or near "group"
LINE 2:     group int primary key,
            ^

[SQL: CREATE TABLE jieunshop200.test (
    group int primary key,
    'mailing address' varchar(32)
);]
(Background on this error at: http://sqlalche.me/e/f405)

In [ ]:
%%sql

CREATE TABLE jieunshop200.test (
    "group" int primary key,
    "mailing address" varchar(32)
);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.

[]

### 다양한 WHERE clause 사용해보기

WHERE에서 "in"을 사용한 clause 사용해보기

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel in ('Google','Facebook');  -- not in

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel like '%oo%';   -- not like

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel like 'F%';

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(16791,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.session_timestamp
WHERE ts BETWEEN '2019-05-01' and '2019-06-01';

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(6261,)]

### NULL과 TRUE/FALSE 이해하기

In [ ]:
%%sql

SELECT COUNT(1)
FROM jieunshop200.test_table
WHERE value is NULL; -- primary key로 지정된 필드에 꼭 해보는 것이 좋음. WHERE value != NULL이 아님. IS NULL의 반대는 IS NOT NULL

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

기본적으로 필드는 NULL 값을 가질 수 있음. 만일 어느 필드의 값이 NULL이 될 수 없다면 CREATE TABLE 실행시 지정가능

In [ ]:
%%sql

DROP TABLE IF EXISTS jieunshop200.test_null;
CREATE TABLE jieunshop200.test_null (
    value int NOT NULL
);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO jieunshop200.test_null VALUES (NULL);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev

InternalError: ignored

Boolean 필터링과 NULL과의 관계

In [ ]:
%%sql

DROP TABLE IF EXISTS jieunshop200.test_boolean;
CREATE TABLE jieunshop200.test_boolean (
    value boolean 
)

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO jieunshop200.test_boolean VALUES (True), (False), (True), (True), (True), (NULL);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM jieunshop200.test_boolean;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[(True,), (False,), (True,), (True,), (True,), (None,)]

In [ ]:
%%sql

SELECT COUNT(1) FROM jieunshop200.test_boolean WHERE value = False;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

In [ ]:
%%sql

SELECT COUNT(1) FROM jieunshop200.test_boolean WHERE value is not True;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2,)]

NULL이 들어간 경우의 연산은?

In [ ]:
%%sql

SELECT COUNT(NULL);

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(0,)]

In [ ]:
%%sql

SELECT 1/NULL;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(None,)]

In [ ]:
%%sql

SELECT 0+NULL;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(None,)]

### COALESCE, NULLIF

In [ ]:
%%sql

SELECT 100/value
FROM jieunshop200.test_table;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
(psycopg2.extensions.QueryCanceledError) Divide by zero

[SQL: SELECT 100/value
FROM jieunshop200.test_table;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [ ]:
%%sql

SELECT 100/NULLIF(value, 0)
FROM jieunshop200.test_table;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None,), (100,), (100,), (None,), (None,), (25,), (33,)]

In [ ]:
%%sql

SELECT value, COALESCE(value, 1) -- NULL인 경우 1을 대신 사용하고 싶다면
FROM jieunshop200.test_table;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None, 1), (1, 1), (1, 1), (0, 0), (0, 0), (4, 4), (3, 3)]

### 요약 테이블을 CTAS (Create Table 이름 As SELECT)로 생성해보기

In [ ]:
%%sql

CREATE TABLE jieunshop200.monthly_active_user_summary AS 
SELECT TO_CHAR(ts, 'YYYY-MM') AS month, COUNT(DISTINCT userid)
FROM raw_data.user_session_channel A
JOIN raw_data.session_timestamp B ON A.sessionid = B.sessionid
GROUP BY 1
ORDER BY 1 DESC;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

SELECT * FROM jieunshop200.monthly_active_user_summary;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-11', 721),
 ('2019-08', 662),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281)]

In [ ]:
%%sql

DROP TABLE jieunshop200.monthly_active_user_summary;

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.

[]

### Assignment1 사용자별로 처음채널, 마지막채널

####1) 251번 사용자의 첫번째 채널, 마지막 채널 알아보기

In [ ]:
%%sql
SELECT ts, channel
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
WHERE userid = 251
ORDER BY 1
LIMIT 5

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.datetime(2019, 5, 1, 12, 18, 26, 637000), 'Facebook'),
 (datetime.datetime(2019, 5, 2, 13, 6, 12, 47000), 'Instagram'),
 (datetime.datetime(2019, 5, 3, 13, 43, 21, 857000), 'Instagram'),
 (datetime.datetime(2019, 5, 4, 13, 54, 0, 610000), 'Instagram'),
 (datetime.datetime(2019, 5, 5, 13, 30, 8, 260000), 'Google')]

#### 2) Row_number 사용

#### 첫번째 채널만

In [ ]:
%%sql
With seq_table AS (
select userid, ts, channel, ROW_NUMBER() OVER (PARTITION BY userID ORDER BY ts) AS row_num
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
)



SELECT * FROM seq_table
WHERE row_num = 1 
ORDER BY userid
Limit 10 --임의로 10줄만

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(27, datetime.datetime(2019, 5, 1, 17, 3, 59, 957000), 'Youtube', 1),
 (29, datetime.datetime(2019, 5, 1, 19, 13, 33, 147000), 'Naver', 1),
 (33, datetime.datetime(2019, 5, 1, 12, 22, 45, 597000), 'Google', 1),
 (34, datetime.datetime(2019, 5, 1, 18, 10, 14, 367000), 'Youtube', 1),
 (36, datetime.datetime(2019, 5, 1, 15, 7, 43, 370000), 'Naver', 1),
 (40, datetime.datetime(2019, 5, 1, 14, 23, 7, 660000), 'Youtube', 1),
 (41, datetime.datetime(2019, 5, 1, 19, 49, 24, 53000), 'Facebook', 1),
 (44, datetime.datetime(2019, 5, 2, 3, 34, 18, 413000), 'Naver', 1),
 (45, datetime.datetime(2019, 5, 1, 15, 53, 7, 17000), 'Youtube', 1),
 (59, datetime.datetime(2019, 5, 1, 14, 1, 3, 87000), 'Instagram', 1)]

### Assignment - 2
#### Gross Revenue가 가장 큰 UserID 10개 찾기
*   Gross revenus: Refund 포함 매출, Refund등의 비용이 빠지면 Net revenue
*   반드시 SQL 사용

In [ ]:
%%sql
SELECT userid, sum(amount) as Gross_revenue
FROM raw_data.user_session_channel as usc
Join raw_data.session_transaction as st on usc.sessionid = st.sessionid
Group by 1
Order by 2 DESC
Limit 10

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(989, 743),
 (772, 556),
 (1615, 506),
 (654, 488),
 (1651, 463),
 (973, 438),
 (262, 422),
 (1099, 421),
 (2682, 414),
 (891, 412)]

### Assignment-3
#### 채널별 월 매출액 테이블 만들기 (본인 스키마 밑에 CTAS로 테이블)
1.   session_timestamp, user_session_channel, channel, session_transaction 테이블 사용
2.   아래와 같은 필드
*   month, channel, uniqueUsers, paidUsers, conversionRate(paiduser/uniqueuser), grossRevenue(refund 포함), netRevenue(refund 제외)

In [ ]:
%%sql

CREATE TABLE jieunshop200.monthly_summary AS
  SELECT to_char(ts, 'YYYY-MM') AS month, Count(Distinct userid)
  FROM raw_data.user_session_channel usc
  JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
  GROUP BY 1
  ORDER BY 1 DESC

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql
SELECT * FROM jieunshop200.monthly_summary
ORDER BY 1

 * postgresql://jieunshop200:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 281),
 ('2019-06', 459),
 ('2019-07', 623),
 ('2019-08', 662),
 ('2019-09', 639),
 ('2019-10', 763),
 ('2019-11', 721)]